; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_11_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 - counter
	)
  (:init
		(= (value c0) 5)
	(= (value c1) 23)
	(= (value c2) 29)
	(= (value c3) 39)
	(= (value c4) 89)
	(= (value c5) 37)
	(= (value c6) 62)
	(= (value c7) 93)
	(= (value c8) 1)
	(= (value c9) 23)
	(= (value c10) 95)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
		)
	)
)

; plan
1. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 8 of 10
2. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 8 of 10
3. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 8 of 10
4. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 8 of 10
5. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 8 of 10
6. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 8 of 10
7. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 8 of 10
8. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 8 of 10
9. (increment c5)
   changed: (value c5) from 37 to 45
   goals met: 8 of 10
10. (increment c5)
   changed: (value c5) from 45 to 53
   goals met: 8 of 10
11. (increment c5)
   changed: (value c5) from 53 to 61
   goals met: 8 of 10
12. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 8 of 10
13. (increment c5)
   changed: (value c5) from 61 to 70
   goals met: 7 of 10
14. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 7 of 10
15. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 7 of 10
16. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 7 of 10
17. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 7 of 10
18. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 7 of 10
19. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 7 of 10
20. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 7 of 10
21. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 7 of 10
22. (increase_rate c8)
   changed: (rate_value c8) from 7 to 8
   goals met: 7 of 10
23. (increase_rate c8)
   changed: (rate_value c8) from 8 to 9
   goals met: 7 of 10
24. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 7 of 10
25. (increment c8)
   changed: (value c8) from 1 to 10
   goals met: 7 of 10
26. (increment c8)
   changed: (value c8) from 10 to 19
   goals met: 7 of 10
27. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 7 of 10
28. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 7 of 10
29. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 7 of 10
30. (increase_rate c8)
   changed: (rate_value c8) from 9 to 10
   goals met: 7 of 10
31. (increment c8)
   changed: (value c8) from 19 to 29
   goals met: 6 of 10
32. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 6 of 10
33. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 6 of 10
34. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 6 of 10
35. (increment c8)
   changed: (value c8) from 29 to 39
   goals met: 6 of 10
36. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 6 of 10
37. (decrement c8)
   changed: (value c8) from 39 to 29
   goals met: 6 of 10
38. (decrement c7)
   changed: (value c7) from 93 to 85
   goals met: 6 of 10
39. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 6 of 10
40. (increment c8)
   changed: (value c8) from 29 to 39
   goals met: 6 of 10
41. (decrement c7)
   changed: (value c7) from 85 to 76
   goals met: 6 of 10
42. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 6 of 10
43. (decrement c8)
   changed: (value c8) from 39 to 29
   goals met: 6 of 10
44. (decrement c7)
   changed: (value c7) from 76 to 66
   goals met: 6 of 10
45. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 10
46. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 10
47. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 6 of 10
48. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 6 of 10
49. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 6 of 10
50. (decrement c4)
   changed: (value c4) from 89 to 84
   goals met: 6 of 10
51. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 7 of 10
52. (decrement c4)
   changed: (value c4) from 84 to 79
   goals met: 7 of 10
53. (decrement c4)
   changed: (value c4) from 79 to 74
   goals met: 7 of 10
54. (increment c5)
   changed: (value c5) from 60 to 70
   goals met: 6 of 10
55. (decrement c4)
   changed: (value c4) from 74 to 69
   goals met: 7 of 10
56. (decrement c5)
   changed: (value c5) from 70 to 60
   goals met: 7 of 10
57. (decrement c4)
   changed: (value c4) from 69 to 64
   goals met: 7 of 10
58. (decrement c4)
   changed: (value c4) from 64 to 59
   goals met: 8 of 10
59. (increment c8)
   changed: (value c8) from 29 to 39
   goals met: 8 of 10
60. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 8 of 10
61. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 8 of 10
62. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 8 of 10
63. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 8 of 10
64. (increment c9)
   changed: (value c9) from 23 to 27
   goals met: 8 of 10
65. (increment c9)
   changed: (value c9) from 27 to 31
   goals met: 8 of 10
66. (increment c9)
   changed: (value c9) from 31 to 35
   goals met: 8 of 10
67. (increment c9)
   changed: (value c9) from 35 to 39
   goals met: 8 of 10
68. (increment c9)
   changed: (value c9) from 39 to 43
   goals met: 9 of 10
69. (decrement c7)
   changed: (value c7) from 66 to 56
   goals met: 8 of 10
70. (increment c8)
   changed: (value c8) from 39 to 49
   goals met: 7 of 10
71. (increment c9)
   changed: (value c9) from 43 to 47
   goals met: 7 of 10
72. (increment c9)
   changed: (value c9) from 47 to 51
   goals met: 8 of 10
73. (increment c7)
   changed: (value c7) from 56 to 66
   goals met: 9 of 10
74. (increment c8)
   changed: (value c8) from 49 to 59
   goals met: 8 of 10
75. (increment c9)
   changed: (value c9) from 51 to 55
   goals met: 8 of 10
76. (increment c9)
   changed: (value c9) from 55 to 59
   goals met: 8 of 10
77. (increment c9)
   changed: (value c9) from 59 to 63
   goals met: 9 of 10
78. (increment c8)
   changed: (value c8) from 59 to 69
   goals met: 9 of 10
79. (increment c9)
   changed: (value c9) from 63 to 67
   goals met: 9 of 10
80. (increment c9)
   changed: (value c9) from 67 to 71
   goals met: 10 of 10
